test/stress/mixing-mortars.stress-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 100

scenarios:
  - flow:
      - post:
          url: "/mixing-mortars"
          json:
            requiredDensity: 1.5
            mortarVolume: 10
            mortarDensity: 1.2
            mortarToAddedDensity: 1.8