test/stress/water-quantity-to-decrease-mortar-density.stress-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Тестирование объёма воды"

scenarios:
  - flow:
      - post:
          url: "/water-quantity-to-decrease-mortar-density"
          headers:
            Content-Type: "application/json"
          json:
            requiredDensity: 1.0
            wellMortarVolume: 10
            mortarDensity: 1.3