test/stress/well-volume.stress-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Расчёт объёма скважины"

scenarios:
  - flow:
      - post:
          url: "/well-volume"
          headers:
            Content-Type: "application/json"
          json:
            _ID: 120
            _Lsec: 1000